<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
    <%--
    	연산자
    	1. 산술연산자 (+/-/*///%)
    			+는 순수하게 덧셈만 가능(문자열 결합ㄴ이 불가능)
    			
    			$(10+10}
    	
    		/ : 나누기
    		${5/2} => 2.5
    		${5 div 2}
    		
    		% : 결과는 왼쪽편 부호
    				${10%3} => 1/2
    				#{20%4) 58			
    				#{20%4) 
    				#{20%4) 
    				
    				${10 mod 3} =1
    				${10 mod -3} =1
    				${-10 mod 3} =1
    				${-10 mod -3} =1
    		2. 비교연산자
    				==(eq), != (ne), >(lt) , <(gt) , <=(le) , >=(re) => true/false
    				10 eq 10
    		3. 논리 연산자
    				&&(AND)
    				||(or)
    		4. empty => empty list
    		5. 삼항연산자 => 조건 값?값
    										curpage>?curpage-1:curpage
    										endPage<totalpage?
    		*************단항 연산자 : 존재하지 않는다
    			
   --%>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>Insert title here</title>
</head>
<body>
<%--
&#36;{10+10}=${10+10}<br>
&#36;{10+"10"}=${10+10 }<br> 
&#36;{null+10}=${null+10}<br>
&#36;{5/2}=${5/2}: 정수/정수 = 실수<br>
&#36;{5 div 2}=${5 div 2}: 정수/정수 = 실수<br>
&#36;{5 +=2}=${5 += 2}: 문자열 결합<br>
 --%>
 <%--
 &#36;{10==10}=${10==10}<br>
&#36;{10 eq 10"}=${10 eq 10 }<br> 

&#36;{10!=10}=${10!=10}<br>
&#36;{10me 0"}=${10 ne 10 }<br> 

&#36;{10<10}=${10<10}<br>
&#36;{10 lt"10"}=${10 lt 10 }<br> 

&#36;{10>10}=${10>10}<br>
&#36;{10 gt "10"}=${10 gt 10 }<br> 

&#36;{10<=10}=${10<=10}<br>
&#36;{10 re "10"}=${10 re 10 }<br> 
 --%>
&#36;{"홍길동"!="심청이}=${"홍길동" != "심청이" }<br>
&#36;{"홍길동"!="심청이}=${"홍길동" != "심청이" }<br>
</body>
</html>